Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/projects/djangordf.po
Languages: de

source: DjangoRDF is a **Django-based RDF framework** that enables structured management, querying, and serialization of RDF data within Django applications. It provides tools to integrate **RDF triple stores**, perform **SPARQL queries**, and facilitate **Linked Data publishing**.
de: DjangoRDF ist ein **Django-basiertes RDF-Framework**, das die strukturierte Verwaltung, Abfrage und Serialisierung von RDF-Daten in Django-Anwendungen ermöglicht. Es bietet Werkzeuge zur Integration von **RDF-Triple-Stores**, zur Durchführung von **SPARQL-Abfragen** und zur **Veröffentlichung von Linked Data**.

source: Features of DjangoRDF
de: Funktionen von DjangoRDF

source: **Django ORM-style RDF models**: Manage RDF data like Django models.
de: **Django ORM-ähnliche RDF-Modelle**: Verwalten Sie RDF-Daten wie Django-Modelle.

source: **SPARQL Query Integration**: Run queries against linked data.
de: **SPARQL-Abfrageintegration**: Führen Sie Abfragen gegen Linked Data aus.

source: **RDF Serialization & Content Negotiation**: Supports **JSON-LD, RDF/XML, Turtle, and N-Triples**.
de: **RDF-Serialisierung & Inhaltsaushandlung**: Unterstützt **JSON-LD, RDF/XML, Turtle und N-Triples**.

source: **Triple Store Compatibility**: Works with **Apache Jena Fuseki, Virtuoso, and GraphDB**.
de: **Triple-Store-Kompatibilität**: Funktioniert mit **Apache Jena Fuseki, Virtuoso und GraphDB**.

source: **Automatic RDF Data Mapping**: Define models that automatically map to RDF properties.
de: **Automatische RDF-Datenzuordnung**: Definieren Sie Modelle, die automatisch RDF-Eigenschaften zuordnen.

source: How to Use DjangoRDF
de: Wie man DjangoRDF verwendet

source: Setting Up the Environment
de: Einrichten der Umgebung

source: Clone the repository
de: Klonen Sie das Repository

source: Create a virtual environment (Recommended)
de: Erstellen Sie eine virtuelle Umgebung (empfohlen)

source: Install dependencies
de: Installieren Sie Abhängigkeiten

source: Configuring DjangoRDF
de: Konfigurieren von DjangoRDF

source: To use DjangoRDF, add it to your Django settings
de: Um DjangoRDF zu verwenden, fügen Sie es zu Ihren Django-Einstellungen hinzu

source: Configure the SPARQL endpoint in `settings.py`
de: Konfigurieren Sie den SPARQL-Endpunkt in `settings.py`

source: Running Django Commands
de: Ausführen von Django-Befehlen

source: DjangoRDF provides management commands to interact with RDF data.
de: DjangoRDF bietet Verwaltungsbefehle zur Interaktion mit RDF-Daten.

source: **List available RDF models**
de: **Verfügbare RDF-Modelle auflisten**

source: **Run a SPARQL query**
de: **Eine SPARQL-Abfrage ausführen**

source: **Load RDF data into the triple store**
de: **RDF-Daten in den Triple-Store laden**

source: Defining RDF Models
de: Definieren von RDF-Modellen

source: DjangoRDF allows you to define RDF models similar to Django ORM models.
de: DjangoRDF ermöglicht es Ihnen, RDF-Modelle ähnlich wie Django ORM-Modelle zu definieren.

source: Example model definition
de: Beispiel für eine Modelldefinition

source: Querying RDF Data
de: Abfragen von RDF-Daten

source: You can use Django's QuerySet-like API to retrieve RDF data
de: Sie können die QuerySet-ähnliche API von Django verwenden, um RDF-Daten abzurufen

source: Troubleshooting & Support
de: Fehlersuche & Unterstützung

source: **SPARQL queries not returning results?** Check if the endpoint URL is correct.
de: **SPARQL-Abfragen liefern keine Ergebnisse?** Überprüfen Sie, ob die Endpunkt-URL korrekt ist.

source: **Data not loading?** Validate RDF data before importing.
de: **Daten werden nicht geladen?** Validieren Sie RDF-Daten vor dem Import.

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Benötigen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/

source: --- DjangoRDF simplifies RDF management in Django applications. Start integrating structured Linked Data today! \🚀
de: -- DjangoRDF vereinfacht die RDF-Verwaltung in Django-Anwendungen. Beginnen Sie noch heute mit der Integration von strukturierten Linked Data! \🚀
