Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/projects/generators.po
Languages: de

source: JudaicaLink Generators
de: JudaicaLink-Generatoren

source: Features of JudaicaLink Generators
de: Funktionen der JudaicaLink-Generatoren

source: **Automatic RDF generation** from different data formats.
de: **Automatische RDF-Generierung** aus verschiedenen Datenformaten.

source: **Data enrichment** using external authority files like GND and Wikidata.
de: **Datenanreicherung** unter Verwendung externer Normdateien wie GND und Wikidata.

source: **Batch processing** of large datasets.
de: **Stapelverarbeitung** großer Datensätze.

source: **Integration with Django commands** for managing and running generators.
de: **Integration mit Django-Befehlen** zur Verwaltung und Ausführung von Generatoren.

source: How to Use JudaicaLink Generators
de: So verwenden Sie JudaicaLink-Generatoren

source: Setting Up the Environment
de: Einrichtung der Umgebung

source: Running a Generator
de: Ausführen eines Generators

source: For example ::
de: Zum Beispiel ::

source: Running Django Commands
de: Ausführen von Django-Befehlen

source: Available commands:
de: Verfügbare Befehle:

source: `run_generator <dataset>` – Runs a generator for a specific dataset.
de: `run_generator <dataset>` – Führt einen Generator für einen bestimmten Datensatz aus.

source: `list_generators` – Lists all available generators.
de: `list_generators` – Listet alle verfügbaren Generatoren auf.

source: `validate_rdf` – Checks RDF output for errors.
de: `validate_rdf` – Überprüft RDF-Ausgaben auf Fehler.

source: Validating RDF Output
de: Validierung der RDF-Ausgabe

source: Loading Data into JudaicaLink
de: Laden von Daten in JudaicaLink

source: Adding a New Generator
de: Hinzufügen eines neuen Generators

source: To create a new generator:
de: Um einen neuen Generator zu erstellen:

source: **Create a new Python script in the `generators/` folder**.
de: **Erstellen Sie ein neues Python-Skript im Ordner `generators/`**.

source: **Implement data extraction and RDF transformation**.
de: **Implementieren Sie die Datenextraktion und RDF-Transformation**.

source: **Use the RDFLib library to generate triples**.
de: **Verwenden Sie die RDFLib-Bibliothek, um Tripel zu generieren**.

source: **Test and validate RDF output**.
de: **Testen und validieren Sie die RDF-Ausgabe**.

source: Troubleshooting & Support
de: Fehlerbehebung & Unterstützung

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/
