Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/projects/labs.po
Languages: de

source: JudaicaLink Labs is the **main web interface** for searching, exploring, and interacting with the JudaicaLink **knowledge graph**. It provides an easy-to-use interface for users to query and browse structured data about Jewish history, culture, and scholarship.
de: JudaicaLink Labs ist die **zentrale Webschnittstelle** zum Suchen, Erkunden und Interagieren mit dem JudaicaLink **Wissensgraphen**. Es bietet eine benutzerfreundliche Oberfläche, um strukturierte Daten zur jüdischen Geschichte, Kultur und Wissenschaft zu durchsuchen und zu betrachten.

source: Features of JudaicaLink Labs
de: Funktionen von JudaicaLink Labs

source: 1. Entity Search
de: 1. Entitätensuche

source: Users can search for **persons, places, institutions, and texts**.
de: Benutzer können nach **Personen, Orten, Institutionen und Texten** suchen.

source: Results display structured RDF data enriched with external links (e.g., **GND, Wikidata, DBpedia**).
de: Die Ergebnisse zeigen strukturierte RDF-Daten, angereichert mit externen Links (z. B. **GND, Wikidata, DBpedia**).

source: 2. Compact Memory Full-Text Search
de: 2. Volltextsuche in Compact Memory

source: Search within historical Jewish newspapers and periodicals.
de: Suche in historischen jüdischen Zeitungen und Zeitschriften.

source: Indexed texts include metadata and direct links to **Compact Memory** digital archives.
de: Indexierte Texte enthalten Metadaten und direkte Links zu den digitalen Archiven von **Compact Memory**.

source: 3. Compact Memory Entity Extraction
de: 3. Entitätenextraktion aus Compact Memory

source: Extracted **named entities** (people, places, organizations) from digitized texts.
de: Extrahiert **benannte Entitäten** (Personen, Orte, Organisationen) aus digitalisierten Texten.

source: Helps users find references to historical figures and events.
de: Hilft Benutzern, Verweise auf historische Personen und Ereignisse zu finden.

source: 4. SPARQL Query Interface
de: 4. SPARQL-Abfrageschnittstelle

source: Advanced users can write **SPARQL queries** to access structured data.
de: Fortgeschrittene Benutzer können **SPARQL-Abfragen** schreiben, um auf strukturierte Daten zuzugreifen.

source: SPARQL endpoint: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.
de: SPARQL-Endpunkt: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.

source: How to Use JudaicaLink Labs
de: Wie man JudaicaLink Labs benutzt

source: Searching for Entities
de: Suche nach Entitäten

source: Visit `https://labs.judaicalink.org <https://labs.judaicalink.org>`_.
de: Besuchen Sie `https://labs.judaicalink.org <https://labs.judaicalink.org>`_.

source: Use the **search bar** to enter a term (e.g., "Moses Mendelssohn").
de: Nutzen Sie die **Suchleiste**, um einen Begriff einzugeben (z. B. „Moses Mendelssohn“).

source: Browse entity pages containing structured data and external references.
de: Durchsuchen Sie Entitätsseiten mit strukturierten Daten und externen Verweisen.

source: Running a SPARQL Query
de: Ausführen einer SPARQL-Abfrage

source: Go to **SPARQL Endpoint**: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.
de: Gehen Sie zum **SPARQL-Endpunkt**: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.

source: Enter a query, such as:
de: Geben Sie eine Abfrage ein, zum Beispiel:

source: Execute the query and view results in **JSON, XML, or CSV format**.
de: Führen Sie die Abfrage aus und sehen Sie sich die Ergebnisse im **JSON-, XML- oder CSV-Format** an.

source: Exploring Compact Memory Data
de: Erkunden von Compact Memory-Daten

source: Select **"Compact Memory Search"** on the search page.
de: Wählen Sie auf der Suchseite **„Compact Memory-Suche“** aus.

source: Enter a keyword (e.g., "Zionism").
de: Geben Sie ein Schlüsselwort ein (z. B. „Zionismus“).

source: View search results with text snippets and source links.
de: Sehen Sie sich die Suchergebnisse mit Textauszügen und Quellenlinks an.

source: Technical Overview
de: Technische Übersicht

source: Built using **Django (Python)**.
de: Erstellt mit **Django (Python)**.

source: Uses **SOLR** for optimized search indexing.
de: Verwendet **SOLR** für optimierte Suchindizierung.

source: Relies on **Apache Jena Fuseki** for SPARQL query processing.
de: Nutzt **Apache Jena Fuseki** zur Verarbeitung von SPARQL-Abfragen.

source: Troubleshooting & Support
de: Fehlersuche & Unterstützung

source: **Error accessing data?** Ensure the **SPARQL endpoint is online**.
de: **Fehler beim Zugriff auf Daten?** Stellen Sie sicher, dass der **SPARQL-Endpunkt online** ist.

source: **Need help?** Contact us at `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
