Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/projects/pubby.po
Languages: de

source: JudaicaLink Pubby is a **linked data server** that provides a human-readable and machine-accessible interface for RDF data. It serves as a **SPARQL endpoint** and **Linked Data interface** for querying and browsing JudaicaLink’s structured datasets.
de: JudaicaLink Pubby ist ein **Linked Data-Server**, der eine menschenlesbare und maschinenzugängliche Schnittstelle für RDF-Daten bereitstellt. Es dient als **SPARQL-Endpunkt** und **Linked Data-Schnittstelle** zum Abfragen und Durchsuchen der strukturierten Datensätze von JudaicaLink.

source: Features of JudaicaLink Pubby
de: Funktionen von JudaicaLink Pubby

source: 1. SPARQL Query Interface
de: 1. SPARQL-Abfrageschnittstelle

source: Users can run **SPARQL queries** to retrieve structured information.
de: Nutzer können **SPARQL-Abfragen** ausführen, um strukturierte Informationen abzurufen.

source: Supports **Linked Data browsing** by providing entity URIs.
de: Unterstützt das **Durchsuchen von Linked Data**, indem es Entitäts-URIs bereitstellt.

source: SPARQL Endpoint: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.
de: SPARQL-Endpunkt: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.

source: 2. RDF Data Exploration
de: 2. RDF-Datenexploration

source: Each entity has a **dedicated RDF page**, accessible through content negotiation.
de: Jede Entität hat eine **eigene RDF-Seite**, die über Inhaltsverhandlung zugänglich ist.

source: Supports multiple formats, including **RDF/XML, Turtle, and JSON-LD**.
de: Unterstützt mehrere Formate, einschließlich **RDF/XML, Turtle und JSON-LD**.

source: Example entity URL: `https://data.judaicalink.org/data/html/yivo/moses-mendelssohn`
de: Beispiel-Entitäts-URL: `https://data.judaicalink.org/data/html/yivo/moses-mendelssohn`

source: 3. Integration with Linked Data Services
de: 3. Integration mit Linked Data-Services

source: JudaicaLink Pubby integrates with **Wikidata, GND, VIAF, and DBpedia**.
de: JudaicaLink Pubby integriert sich mit **Wikidata, GND, VIAF und DBpedia**.

source: Provides structured URIs that link to external data sources.
de: Bietet strukturierte URIs, die zu externen Datenquellen verlinken.

source: How to Use JudaicaLink Pubby
de: So verwenden Sie JudaicaLink Pubby

source: 1. Browsing RDF Data
de: 1. Durchsuchen von RDF-Daten

source: Visit `https://data.judaicalink.org <https://data.judaicalink.org>`_.
de: Besuchen Sie `https://data.judaicalink.org <https://data.judaicalink.org>`_.

source: Search for an entity (e.g., "Moses Mendelssohn").
de: Nach einer Entität suchen (z. B. "Moses Mendelssohn").

source: Click on an entity to view its RDF representation.
de: Klicken Sie auf eine Entität, um ihre RDF-Repräsentation anzuzeigen.

source: 2. Running a SPARQL Query
de: 2. Ausführen einer SPARQL-Abfrage

source: Go to the **SPARQL Endpoint**: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_
de: Gehe zum **SPARQL-Endpunkt**: `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_

source: Enter a query, such as:
de: Geben Sie eine Abfrage ein, z. B.:

source: Execute the query and view results in **JSON, XML, or CSV format**.
de: Führen Sie die Abfrage aus und sehen Sie sich die Ergebnisse im **JSON-, XML- oder CSV-Format** an.

source: 3. Accessing Data in Different Formats
de: 3. Zugriff auf Daten in verschiedenen Formaten

source: You can retrieve entity data in various formats using **content negotiation**:
de: Sie können Entitätsdaten in verschiedenen Formaten abrufen, indem Sie **Inhaltsverhandlung** verwenden:

source: Technical Overview
de: Technischer Überblick

source: Built using **Apache Jena Fuseki** for RDF storage and SPARQL processing.
de: Erstellt mit **Apache Jena Fuseki** für RDF-Speicherung und SPARQL-Verarbeitung.

source: Uses **Django Pubby** for serving Linked Data.
de: Verwendet **Django Pubby** zum Bereitstellen von Linked Data.

source: Database & Data Sources
de: Datenbank & Datenquellen

source: Stores data in **RDF triple format**.
de: Speichert Daten im **RDF-Triple-Format**.

source: Integrates external resources such as **Wikidata, DBpedia, and GND**.
de: Integriert externe Ressourcen wie **Wikidata, DBpedia und GND**.

source: Contributing to JudaicaLink Pubby
de: Zur JudaicaLink Pubby beitragen

source: Setting Up a Development Environment
de: Einrichten einer Entwicklungsumgebung

source: 1. **Clone the repository** ::
de: 1. **Klonen des Repositories** ::

source: 2. **Create a virtual environment** ::
de: 2. **Erstellen einer virtuellen Umgebung** ::

source: 3. **Install dependencies** ::
de: 3. **Abhängigkeiten installieren** ::

source: 4. **Run the development server** ::
de: 4. **Starten des Entwicklungsservers** ::

source: Open http://127.0.0.1:8000/ in your browser.
de: Öffnen Sie http://127.0.0.1:8000/ in Ihrem Browser.

source: Deployment
de: Bereitstellung

source: Pubby is deployed using **Docker**.
de: Pubby wird mit **Docker** bereitgestellt.

source: RDF data is loaded via **SPARQL Update queries**.
de: RDF-Daten werden über **SPARQL-Update-Abfragen** geladen.

source: Troubleshooting & Support
de: Problembehandlung & Support

source: **SPARQL query errors?** Check syntax and dataset availability.
de: **SPARQL-Abfragefehler?** Überprüfen Sie die Syntax und die Verfügbarkeit des Datensatzes.

source: **RDF data not loading?** Verify dataset ingestion.
de: **RDF-Daten werden nicht geladen?** Überprüfen Sie die Datensatzaufnahme.

source: **Need help?** Contact us at `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.

source: --- JudaicaLink Pubby provides structured Linked Data access to Jewish studies datasets. Explore, query, and integrate JudaicaLink’s knowledge graph today! \🚀
de: --- JudaicaLink Pubby bietet strukturierten Linked Data-Zugriff auf jüdische Studiendatensätze. Entdecken, abfragen und integrieren Sie den Wissensgraphen von JudaicaLink noch heute! \🚀
