Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/projects/rdf_generator.po
Languages: de

source: The RDF Generator is a **Python library** designed to transform structured and unstructured data into **RDF triples**, making them compatible with **Linked Data principles**. It is primarily used in the JudaicaLink project to convert datasets into RDF format for integration into the JudaicaLink **knowledge graph**.
de: Der RDF-Generator ist eine **Python-Bibliothek**, die strukturierte und unstrukturierte Daten in **RDF-Tripel** umwandelt und sie mit den **Prinzipien des Linked Data** kompatibel macht. Er wird hauptsächlich im JudaicaLink-Projekt verwendet, um Datensätze in RDF-Format zu konvertieren, um sie in den JudaicaLink **Wissensgraphen** zu integrieren.

source: Features of RDF Generator
de: Funktionen des RDF-Generators

source: **Support for multiple data sources** (spreadsheets, XML, JSON, CSV, web scraping).
de: **Unterstützung für mehrere Datenquellen** (Tabellenkalkulationen, XML, JSON, CSV, Web-Scraping).

source: **Automatic RDF conversion** using predefined mappings.
de: **Automatische RDF-Konvertierung** mit vordefinierten Zuordnungen.

source: **SPARQL update compatibility** for inserting RDF data into triple stores.
de: **SPARQL-Update-Kompatibilität** zum Einfügen von RDF-Daten in Triple-Stores.

source: **Integration with Django and external APIs**.
de: **Integration mit Django und externen APIs**.

source: **Export support for RDF/XML, Turtle, N-Triples, and JSON-LD formats**.
de: **Exportunterstützung für RDF/XML, Turtle, N-Triples und JSON-LD-Formate**.

source: Setting Up the Environment
de: Einrichten der Umgebung

source: **Clone the repository**
de: **Klonen des Repositorys**

source: **Create a virtual environment** (Recommended)
de: **Erstellen einer virtuellen Umgebung** (Empfohlen)

source: **Install dependencies**
de: **Abhängigkeiten installieren**

source: Generating RDF Data
de: Generieren von RDF-Daten

source: To generate RDF data, use the command-line tool or integrate it into a Python script.
de: Verwenden Sie zum Generieren von RDF-Daten das Befehlszeilentool oder integrieren Sie es in ein Python-Skript.

source: Example usage
de: Beispielverwendung

source: Supported formats:
de: Unterstützte Formate:

source: Integrating with Python
de: Integration mit Python

source: You can also use the RDF Generator in your Python scripts
de: Sie können den RDF-Generator auch in Ihren Python-Skripten verwenden

source: Defining RDF Mappings
de: Definieren von RDF-Zuordnungen

source: Mappings define how input data is transformed into RDF triples. Example mapping file (YAML):
de: Zuordnungen definieren, wie Eingabedaten in RDF-Tripel umgewandelt werden. Beispiel-Mapping-Datei (YAML):

source: Running with a mapping file
de: Mit einer Mapping-Datei ausführen

source: Validating RDF Output
de: Überprüfen der RDF-Ausgabe

source: Once RDF is generated, validate it to ensure correctness
de: Wenn RDF generiert wurde, überprüfen Sie es, um die Korrektheit sicherzustellen

source: Or using the RDF Generator tool
de: Oder mit dem RDF-Generator-Tool

source: Loading RDF into a Triple Store
de: Laden von RDF in einen Triple-Store

source: To load RDF data into **Apache Jena Fuseki**
de: Um RDF-Daten in **Apache Jena Fuseki** zu laden

source: Alternatively, using SPARQL Update
de: Alternativ mit SPARQL-Update

source: Troubleshooting & Support
de: Problembehandlung & Unterstützung

source: **Invalid RDF syntax?** Ensure mappings are correct and validate RDF output.
de: **Ungültige RDF-Syntax?** Stellen Sie sicher, dass die Zuordnungen korrekt sind und überprüfen Sie die RDF-Ausgabe.

source: **SPARQL endpoint not responding?** Check network connectivity and endpoint availability.
de: **SPARQL-Endpunkt reagiert nicht?** Überprüfen Sie die Netzwerkverbindung und die Verfügbarkeit des Endpunkts.

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/

source: --- The RDF Generator streamlines RDF data creation for JudaicaLink and other Linked Data projects. Start transforming your data today! \🚀
de: --- Der RDF-Generator vereinfacht die Erstellung von RDF-Daten für JudaicaLink und andere Linked-Data-Projekte. Beginnen Sie noch heute mit der Umwandlung Ihrer Daten! \🚀
