Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/projects/site.po
Languages: de

source: JudaicaLink Site
de: JudicaLink Seite

source: JudaicaLink Site is the **public-facing portal** of the JudaicaLink project. It provides background information, dataset overviews, project updates, and links to related JudaicaLink resources, including Labs and Pubby. The site is built using **Hugo**, a static site generator, ensuring fast performance and easy maintainability.
de: JudicaLink Seite ist das **öffentlich zugängliche Portal** des JudaicaLink Projekts. Es bietet Hintergrundinformationen, Übersichten über Datensätze, Projektaktualisierungen und Links zu verwandten JudaicaLink-Ressourcen, einschließlich Labs und Pubby. Die Seite wird mit **Hugo**, einem statischen Seitengenerator, erstellt, was eine schnelle Leistung und einfache Wartbarkeit gewährleistet.

source: Features of JudaicaLink Site
de: Funktionen der JudaicaLink Seite

source: 1. Overview of JudaicaLink
de: 1. Übersicht über JudaicaLink

source: Describes the mission and goals of JudaicaLink.
de: Beschreibt die Mission und Ziele von JudaicaLink.

source: Explains how JudaicaLink integrates Jewish studies datasets into a Linked Open Data knowledge graph.
de: Erklärt, wie JudaicaLink jüdische Studiendatensätze in einen Linked Open Data-Wissensgraphen integriert.

source: 2. Dataset Information
de: 2. Datensatzinformationen

source: Lists available **datasets** and their sources.
de: Listet verfügbare **Datensätze** und ihre Quellen auf.

source: Provides links to **entity pages** and **SPARQL queries**.
de: Bietet Links zu **Entitätsseiten** und **SPARQL-Abfragen**.

source: 3. News and Updates
de: 3. Neuigkeiten und Aktualisierungen

source: Regular updates on JudaicaLink’s latest developments, publications, and features.
de: Regelmäßige Updates zu den neuesten Entwicklungen, Veröffentlichungen und Funktionen von JudaicaLink.

source: Information about conferences and workshops related to JudaicaLink.
de: Informationen zu Konferenzen und Workshops im Zusammenhang mit JudaicaLink.

source: 4. Legal and Contact Information
de: 4. Rechts- und Kontaktinformationen

source: Licensing information for datasets and code.
de: Lizenzinformationen für Datensätze und Code.

source: Contact details for JudaicaLink project maintainers.
de: Kontaktdaten für die Verantwortlichen des JudaicaLink-Projekts.

source: Navigating the Website
de: Durchsuchen der Website

source: Visit `https://www.judaicalink.org <https://www.judaicalink.org>`_.
de: Besuchen Sie `https://www.judaicalink.org <https://www.judaicalink.org>`_.

source: Browse the menu for **Datasets, Documentation, News, and Project Information**.
de: Durchsuchen Sie das Menü nach **Datensätzen, Dokumentation, Neuigkeiten und Projektinformationen**.

source: Click on dataset links to explore entity data and SPARQL examples.
de: Klicken Sie auf Datensatzlinks, um Entitätsdaten und SPARQL-Beispiele zu erkunden.

source: Finding Dataset Details
de: Datensatzdetails finden

source: Go to **Datasets** and select a dataset to view its metadata and sources.
de: Gehen Sie zu **Datensätzen** und wählen Sie einen Datensatz aus, um seine Metadaten und Quellen anzuzeigen.

source: Use provided **SPARQL query examples** to interact with structured data.
de: Benutzen Sie die bereitgestellten **SPARQL-Abfragebeispiele**, um mit strukturierten Daten zu interagieren.

source: Reading News & Updates
de: Lesen von Neuigkeiten und Aktualisierungen

source: Visit `https://www.judaicalink.org/news/ <https://www.judaicalink.org/news/>`_ for the latest project announcements.
de: Besuchen Sie `https://www.judaicalink.org/news/ <https://www.judaicalink.org/news/>`_ für die neuesten Projektankündigungen.

source: Technical Overview
de: Technischer Überblick

source: Built using **Hugo**, a static site generator.
de: Erstellt mit **Hugo**, einem statischen Seitengenerator.

source: Hosted with **NGINX** for continuous deployment.
de: Gehostet mit **NGINX** für kontinuierliche Bereitstellung.

source: Data Sources
de: Datenquellen

source: All datasets are sourced from **JudaicaLink Labs** and **SPARQL endpoints**.
de: Alle Datensätze stammen aus **JudaicaLink Labs** und **SPARQL-Endpunkten**.

source: Links to external data sources like **Wikidata, GND, and Compact Memory**.
de: Links zu externen Datenquellen wie **Wikidata, GND und Compact Memory**.

source: Contributing to JudaicaLink Site
de: Zur JudaicaLink Seite beitragen

source: Setting Up the Site Locally
de: Die Seite lokal einrichten

source: **Clone the repository**
de: **Klonen des Repositories**

source: **Install Hugo** (if not already installed)
de: **Hugo installieren** (falls noch nicht installiert)

source: **Run the local server**
de: **Lokalen Server starten**

source: Open **http://localhost:1313/** in your browser to preview the site.
de: Öffnen Sie **http://localhost:1313/** in Ihrem Browser, um die Seite zu überprüfen.

source: Making Changes
de: Änderungen vornehmen

source: Edit `.md` files in the `content/` directory.
de: Bearbeiten Sie `.md`-Dateien im `content/`-Verzeichnis.

source: Update **dataset descriptions** in the `content/datasets/` folder.
de: Aktualisieren Sie **Datensatzbeschreibungen** im `content/datasets/`-Ordner.

source: Add news updates in the `content/news/` directory.
de: Fügen Sie Neuigkeiten im `content/news/`-Verzeichnis hinzu.

source: Commit changes and push them to GitHub for deployment.
de: Bestätigen Sie die Änderungen und schieben Sie sie zur Bereitstellung auf GitHub.

source: Deployment
de: Bereitstellung

source: The site is deployed on a local server using **Hugo** and **NGINX** as proxy.
de: Die Seite wird auf einem lokalen Server mit **Hugo** und **NGINX** als Proxy bereitgestellt.

source: Troubleshooting & Support
de: Problembehandlung und Unterstützung

source: **Website not loading?** Check `GitHub Issues <https://github.com/judaicalink/judaicalink-site/issues>`_.
de: **Website wird nicht geladen?** Überprüfen Sie `GitHub Issues <https://github.com/judaicalink/judaicalink-site/issues>`_.

source: **Errors in dataset links?** Verify entity URLs in **Labs or Pubby**.
de: **Fehler in Datensatzlinks?** Überprüfen Sie die Entitäts-URLs in **Labs oder Pubby**.

source: **Need help?** Contact us at `https://www.judaicalink.org/contact/ <https://www.judaicalink.org/contact/>`_.
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter `https://www.judaicalink.org/contact/ <https://www.judaicalink.org/contact/>`_.

source: --- JudaicaLink Site serves as the main entry point for users exploring Jewish studies data. Stay updated with the latest project news and dataset expansions at `https://www.judaicalink.org <https://www.judaicalink.org>`_.
de: --- JudaicaLink Site dient als Hauptzugangspunkt für Benutzer, die jüdische Studiendaten erkunden. Bleiben Sie auf dem Laufenden über die neuesten Projektnachrichten und Datensatzerweiterungen unter `https://www.judaicalink.org <https://www.judaicalink.org>`_.
