Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/faq.po
Languages: de

source: Frequently Asked Questions (FAQ)
de: Häufig gestellte Fragen (FAQ)

source: Below are the most common questions about JudaicaLink, its functionality, and how to use it effectively.
de: Unten finden Sie die häufigsten Fragen zu JudaicaLink, seiner Funktionalität und zur effektiven Nutzung.

source: General Questions
de: Allgemeine Fragen

source: What is JudaicaLink?
de: Was ist JudaicaLink?

source: JudaicaLink is a Linked Open Data project that provides structured, interconnected knowledge about Jewish history, culture, and scholarship. It integrates data from various sources and makes it available for researchers, historians, and digital humanities projects.
de: JudaicaLink ist ein Linked Open Data-Projekt, das strukturiertes, vernetztes Wissen über jüdische Geschichte, Kultur und Wissenschaft bereitstellt. Es integriert Daten aus verschiedenen Quellen und stellt sie Forschern, Historikern und digitalen Geisteswissenschaften zur Verfügung.

source: Who maintains JudaicaLink?
de: Wer betreut JudaicaLink?

source: JudaicaLink is developed and maintained by *Hochschule Mannheim* in collaboration with *FID Jüdische Studien*, *UB Frankfurt*, and other partners.
de: JudaicaLink wird von der *Hochschule Mannheim* in Zusammenarbeit mit dem *FID Jüdische Studien*, der *UB Frankfurt* und weiteren Partnern entwickelt und betreut.

source: Is JudaicaLink free to use?
de: Ist JudaicaLink kostenlos nutzbar?

source: Yes! JudaicaLink follows the principles of *Open Data, Open Knowledge, and Open Source*. All datasets are freely accessible.
de: Ja! JudaicaLink folgt den Prinzipien von *Open Data, Open Knowledge und Open Source*. Alle Datensätze sind frei zugänglich.

source: How can I contribute to JudaicaLink?
de: Wie kann ich zu JudaicaLink beitragen?

source: You can contribute by:
de: Sie können beitragen, indem Sie:

source: Providing datasets related to Jewish Studies.
de: Datensätze zu jüdischen Studien bereitstellen.

source: Contributing to RDF data generation.
de: Zur RDF-Datengenerierung beitragen.

source: Enhancing entity linking and enrichment.
de: Entity Linking und Datenanreicherung verbessern.

source: Developing additional tools using the SPARQL endpoint.
de: Zusätzliche Tools unter Verwendung des SPARQL-Endpunkts entwickeln.

source: For detailed contribution guidelines, see the :ref:`Contributing Guide <developer_guide_contributing>`.
de: Für detaillierte Richtlinien zur Mitwirkung siehe den :ref:`Beitragsleitfaden <developer_guide_contributing>`.

source: Using JudaicaLink
de: JudaicaLink nutzen

source: How can I search for information in JudaicaLink?
de: Wie kann ich nach Informationen in JudaicaLink suchen?

source: JudaicaLink offers multiple search methods:
de: JudaicaLink bietet verschiedene Suchmethoden an:

source: *Knowledge Graph Search* – Explore structured data about persons, places, and institutions.
de: *Knowledge Graph-Suche* – Strukturierte Daten über Personen, Orte und Institutionen durchsuchen.

source: *Full-text search in Compact Memory* – Find relevant excerpts in historical Jewish newspapers.
de: *Volltextsuche in Compact Memory* – Relevante Auszüge aus historischen jüdischen Zeitungen finden.

source: *Entity Extraction Search* – Use NLP-extracted entities from Compact Memory to discover connections.
de: *Entitätensuche* – Durch NLP extrahierte Entitäten aus Compact Memory nutzen, um Verbindungen zu entdecken.

source: Where can I find the SPARQL endpoint?
de: Wo finde ich den SPARQL-Endpunkt?

source: The SPARQL endpoint for querying the knowledge graph is available at: \🔗 `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_
de: Der SPARQL-Endpunkt zur Abfrage des Knowledge Graph ist verfügbar unter: \🔗 `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_

source: Does JudaicaLink support content negotiation?
de: Unterstützt JudaicaLink Content-Negotiation?

source: Yes. You can access data in different formats using content negotiation:
de: Ja. Sie können mit Content-Negotiation auf Daten in verschiedenen Formaten zugreifen:

source: How is data stored and structured in JudaicaLink?
de: Wie werden Daten in JudaicaLink gespeichert und strukturiert?

source: JudaicaLink uses *RDF (Resource Description Framework)* to structure data. It is stored in an *Apache Jena Fuseki* triple store and follows the Linked Open Data principles.
de: JudaicaLink verwendet *RDF (Resource Description Framework)* zur Strukturierung von Daten. Diese werden in einem *Apache Jena Fuseki* Triple Store gespeichert und folgen den Prinzipien von Linked Open Data.

source: What technologies does JudaicaLink use?
de: Was ist JudaicaLink?

source: *Frontend*: Hugo (Site), Vue.js (planned improvements)
de: *Frontend*: Hugo (Site), Vue.js (geplante Verbesserungen)

source: *Data Storage*: Apache Jena Fuseki (RDF Triple Store)
de: *Datenlagerung*: Apache Jena Fuseki (RDF Triple Store)

source: *Search*: SOLR
de: *Suche*: SOLR

source: *Deployment*: Docker, Nginx
de: *Bereitstellung*: Docker, Nginx

source: How often is the data updated?
de: Wie oft werden die Daten aktualisiert?

source: JudaicaLink updates its data regularly. The frequency depends on external dataset updates and internal processing cycles.
de: JudaicaLink aktualisiert seine Daten regelmäßig. Die Häufigkeit hängt von externen Datensatzaktualisierungen und internen Verarbeitungszyklen ab.

source: How can I integrate JudaicaLink with my project?
de: Wie kann ich zu JudaicaLink beitragen?

source: Developers can integrate JudaicaLink data by:
de: Entwickler können JudaicaLink-Daten integrieren, indem sie:

source: Using the *SPARQL endpoint* for live queries.
de: Verwendung des *SPARQL-Endpunkts* für Live-Abfragen.

source: Downloading RDF datasets for local processing.
de: Herunterladen von RDF-Datensätzen zur lokalen Verarbeitung.

source: Embedding entity URIs into their knowledge bases.
de: Einbetten von Entitäts-URIs in ihre Wissensbasen.

source: Data and Licensing
de: Daten und Lizenzen

source: What are the licensing terms for using JudaicaLink data?
de: Welche Lizenzbedingungen gelten für die Nutzung von JudaicaLink-Daten?

source: JudaicaLink data is available under open licenses, including *CC BY-SA* and *CC0*, depending on the dataset. Check individual dataset licenses for specifics.
de: JudaicaLink-Daten stehen unter offenen Lizenzen wie *CC BY-SA* und *CC0* zur Verfügung, je nach Datensatz. Überprüfen Sie die einzelnen Datensatzlizenzen für Details.

source: Can I use JudaicaLink data for commercial purposes?
de: Kann ich JudaicaLink-Daten für kommerzielle Zwecke verwenden?

source: Yes, but you must adhere to the respective dataset license. Some datasets require attribution.
de: Ja, aber Sie müssen sich an die jeweilige Datensatzlizenz halten. Einige Datensätze erfordern eine Zuordnung.

source: Troubleshooting & Support
de: Fehlerbehebung und Unterstützung

source: I found incorrect data. How can I report it?
de: Ich habe falsche Daten gefunden. Wie kann ich sie melden?

source: If you find incorrect or outdated data, please contact the JudaicaLink team via the `Contact Page <https://labs.judaicalink.org/contact/>`_.
de: Wenn Sie falsche oder veraltete Daten finden, wenden Sie sich bitte an das JudaicaLink-Team über die `Kontaktseite https://labs.judaicalink.org/contact/>`_.

source: My SPARQL query is too slow. What can I do?
de: Meine SPARQL-Abfrage ist zu langsam. Was kann ich tun?

source: Try *limiting results* with `LIMIT` and `OFFSET`.
de: Versuchen Sie, die Ergebnisse mit `LIMIT` und `OFFSET` zu begrenzen.

source: Optimize queries by *filtering entities early*.
de: Optimieren Sie Abfragen, indem Sie *Entitäten früh filtern*.

source: Use *indexed fields* where possible.
de: Verwenden Sie *indizierte Felder*, wo möglich.

source: I need a dataset that is not available. Can you add it?
de: Ich benötige einen Datensatz, der nicht verfügbar ist. Können Sie ihn hinzufügen?

source: JudaicaLink is open to dataset suggestions. If you have a dataset you’d like to contribute, reach out to us.
de: JudaicaLink steht für Datensatzvorschläge offen. Wenn Sie einen Datensatz beitragen möchten, kontaktieren Sie uns.

source: Getting Help
de: Hilfe erhalten

source: Where can I find more information about JudaicaLink?
de: Wie kann ich nach Informationen in JudaicaLink suchen?

source: *Documentation*: `https://judaicalink-docs.readthedocs.io/ <https://judaicalink-docs.readthedocs.io/>`_
de: *Dokumentation*: `https://judaicalink-docs.readthedocs.io/ <https://judaicalink-docs.readthedocs.io/>`_

source: *FAQ Updates*: Check `https://web.judaicalink.org/faq/ <https://web.judaicalink.org/faq/>`_ for the latest FAQs.
de: *FAQ-Updates*: Überprüfen Sie `https://web.judaicalink.org/faq/ <https://web.judaicalink.org/faq/>`_ für die neuesten FAQs.

source: *Community & Support*: Contact us at `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
de: *Community & Support*: Kontaktieren Sie uns unter `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.

source: --- If your question isn't listed here, feel free to contact us or check the JudaicaLink documentation!
de: --- Wenn Ihre Frage hier nicht aufgeführt ist, kontaktieren Sie uns gerne oder überprüfen Sie die JudaicaLink-Dokumentation!
