Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/getting_started.po
Languages: de

source: Getting Started
de: Erste Schritte

source: Welcome to JudaicaLink! This guide will help you set up the documentation environment and get started with exploring and contributing to the JudaicaLink project and its sub-projects.
de: Willkommen bei JudaicaLink! Dieser Leitfaden hilft Ihnen, die Dokumentationsumgebung einzurichten und mit der Erkundung sowie der Mitarbeit am JudaicaLink-Projekt und seinen Teilprojekten zu beginnen.

source: Prerequisites
de: Voraussetzungen

source: Before getting started, ensure you have the following installed:
de: Bevor Sie beginnen, stellen Sie sicher, dass Sie Folgendes installiert haben:

source: Python 3.8 or later
de: Python 3.8 oder neuer

source: pip (Python package manager)
de: pip (Python-Paketmanager)

source: Virtual environment (optional but recommended)
de: Virtuelle Umgebung (optional, aber empfohlen)

source: Git (for cloning the repository)
de: Git (zum Klonen des Repositorys)

source: Docker (if using containerized deployments)
de: Docker (falls containerisierte Bereitstellungen verwendet werden)

source: Setting Up Locally
de: Lokale Einrichtung

source: Follow these steps to set up the different projects locally:
de: Folgen Sie diesen Schritten, um die verschiedenen Projekte lokal einzurichten:

source: JudaicaLink Docs
de: JudaicaLink Dokumentation

source: JudaicaLink Site
de: JudaicaLink Webseite

source: Using Docker for Local Deployment
de: Docker für lokale Bereitstellung verwenden

source: For a full-stack deployment of all projects together, use Docker:
de: Für eine Full-Stack-Bereitstellung aller Projekte zusammen Docker verwenden:

source: *Clone the Docker Repository*
de: *Repository klonen*

source: *Set Up the Environment*
de: *Umgebung einrichten*

source: *Build and Start Containers*
de: *Container erstellen und starten*

source: Using Read the Docs
de: Read the Docs verwenden

source: JudaicaLink documentation is hosted on *Read the Docs*. You can view the latest version online at:
de: Die JudaicaLink-Dokumentation wird auf *Read the Docs* gehostet. Sie können die neueste Version online unter folgender Adresse einsehen:

source: \📖 `JudaicaLink Docs <https://judaicalink-docs.readthedocs.io/>`_
de: \📖 `JudaicaLink Dokumentation <https://judaicalink-docs.readthedocs.io/>`_

source: Updating Documentation
de: Dokumentation aktualisieren

source: To contribute updates to the documentation:
de: Um Aktualisierungen an der Dokumentation beizutragen:

source: Make changes to the `.rst` files in the `docs/` directory.
de: Machen Sie Änderungen an den `.rst`-Dateien im `docs/`-Verzeichnis.

source: Rebuild the documentation using:
de: *Dokumentation lokal erstellen*

source: Preview the changes locally by opening `_build/html/index.html` in a browser.
de: Vorschau der Änderungen lokal durch Öffnen von `_build/html/index.html` in einem Browser.

source: Commit and push changes:
de: Änderungen committen und pushen:

source: Next Steps
de: Nächste Schritte

source: Read the :ref:`User Guide <user_guide_overview>` for more details on using JudaicaLink.
de: Lesen Sie den :ref:`Benutzerhandbuch <user_guide_overview>` für weitere Informationen zur Verwendung von JudaicaLink.

source: Check the :ref:`Developer Guide <developer_guide_setup>` for information on contributing code.
de: Überprüfen Sie das :ref:`Entwicklerhandbuch <developer_guide_setup>` für Informationen zur Beitrag von Code.

source: Visit the :ref:`FAQ <faq>` if you encounter any issues.
de: Besuchen Sie die :ref:`FAQ <faq>`, wenn Sie auf Probleme stoßen.
