Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/introduction.po
Languages: de

source: Introduction to JudaicaLink
de: Einführung in JudaicaLink

source: What is JudaicaLink?
de: Was ist JudaicaLink?

source: JudaicaLink is a Linked Open Data project that provides structured, interconnected knowledge about Jewish history, culture, and scholarship. The goal is to make Jewish studies data easily accessible, searchable, and reusable for researchers, historians, librarians, and the broader academic community.
de: JudaicaLink ist ein Linked Open Data-Projekt, das strukturiertes und vernetztes Wissen über jüdische Geschichte, Kultur und Wissenschaft bereitstellt. Das Ziel ist es, Daten aus den Jüdischen Studien für Forscher, Historiker, Bibliothekare und die akademische Gemeinschaft leicht zugänglich, durchsuchbar und wiederverwendbar zu machen.

source: By integrating various datasets, JudaicaLink connects existing digital archives, authority files, and bibliographic resources into a *knowledge graph*, enabling more efficient exploration of Jewish sources.
de: Durch die Integration verschiedener Datensätze verbindet JudaicaLink bestehende digitale Archive, Normdateien und bibliografische Ressourcen in einem *Knowledge Graph*, was eine effizientere Erkundung jüdischer Quellen ermöglicht.

source: Project Goals and Functions
de: Projektziele und Funktionen

source: JudaicaLink serves as a *centralized hub* for structured Jewish studies data, offering:
de: JudaicaLink dient als *zentraler Knotenpunkt* für strukturierte Daten aus den Jüdischen Studien und bietet:

source: *Knowledge Graph*: A linked data framework connecting Jewish historical, biographical, and bibliographical datasets.
de: *Knowledge Graph*: Ein Linked-Data-Framework, das jüdisch-historische, biografische und bibliografische Datensätze miteinander verbindet.

source: *Entity-Based Search*: Users can search for people, places, events, and publications through a semantically enriched database.
de: *Entitätsbasierte Suche*: Benutzer können nach Personen, Orten, Ereignissen und Publikationen in einer semantisch angereicherten Datenbank suchen.

source: *Integration with Other Projects*: JudaicaLink integrates with established databases such as *GND, Wikidata, DBpedia, VIAF, and Geonames*.
de: *Integration mit anderen Projekten*: JudaicaLink integriert sich mit etablierten Datenbanken wie *GND, Wikidata, DBpedia, VIAF und Geonames*.

source: *Data Enrichment*: It enhances existing datasets by linking them with external sources and extracting meaningful relationships between entities.
de: *Datenanreicherung*: Bestehende Datensätze werden durch Verknüpfung mit externen Quellen verbessert und bedeutungsvolle Beziehungen zwischen Entitäten extrahiert.

source: *Open Access and Reuse*: All data is *openly available* under principles of Linked Open Data (LOD), making it usable by other institutions and projects.
de: *Offener Zugang und Wiederverwendbarkeit*: Alle Daten sind *frei zugänglich* nach den Prinzipien von Linked Open Data (LOD) und können von anderen Einrichtungen und Projekten genutzt werden.

source: Project Partners
de: Projektpartner

source: JudaicaLink is developed and maintained in collaboration with several institutions and projects, including:
de: JudaicaLink wird in Zusammenarbeit mit verschiedenen Institutionen und Projekten entwickelt und gepflegt, darunter:

source: *Hochschule Mannheim* (Mannheim University of Applied Sciences)
de: *Hochschule Mannheim* (Mannheimer Hochschule für Angewandte Wissenschaften)

source: *University Library Frankfurt* (UB Frankfurt)
de: *Universitätsbibliothek Frankfurt* (UB Frankfurt)

source: *FID Jüdische Studien* (Specialized Information Service for Jewish Studies)
de: *FID Jüdische Studien* (Fachinformationsdienst Jüdische Studien)

source: *Europeana* (A European digital cultural heritage initiative)
de: *Europeana* (Eine europäische Initiative für digitales Kulturerbe)

source: *National Library of Israel (NLI)*
de: *Nationale Bibliothek Israels (NLI)*

source: *DM2E (Digitised Manuscripts to Europeana)*
de: *DM2E (Digitalisierte Manuskripte für Europeana)*

source: *Wikidata and Wikipedia*
de: *Wikidata und Wikipedia*

source: JudaicaLink Components
de: JudaicaLink-Komponenten

source: JudaicaLink consists of multiple sub-projects that work together to support the knowledge graph and its applications:
de: JudaicaLink besteht aus mehreren Teilprojekten, die gemeinsam den Knowledge Graph und seine Anwendungen unterstützen:

source: JudaicaLink Labs is the *core application* that powers the search and entity exploration interface. It allows users to explore Jewish-related datasets through *SPARQL queries, entity linking, and structured search*.
de: JudicaLink Labs ist die *Kernanwendung*, die die Such- und Entitäts-Explorations-Schnittstelle antreibt. Sie ermöglicht es Benutzern, jüdisch-bezogene Datensätze durch *SPARQL-Abfragen, Entitätsverknüpfung und strukturierte Suche* zu erkunden.

source: Built using *Django*
de: Mit *Django* erstellt

source: Provides a *searchable knowledge graph*
de: Stellt einen *durchsuchbaren Knowledge Graph* bereit

source: Supports *Natural Language Processing (NLP)* for entity recognition
de: Unterstützt *Natural Language Processing (NLP)* für die Entitätserkennung

source: 2. JudaicaLink Site
de: 2. JudaicaLink Webseite

source: The JudaicaLink Site is the *public-facing static website* providing background information, project news, and dataset overviews. It is built using *Hugo* and integrates dynamically with the knowledge graph.
de: Die JudaicaLink Site ist die *öffentliche statische Website*, die Hintergrundinformationen, Projektneuigkeiten und Übersichten über Datenbestände bereitstellt. Sie wird mit *Hugo* erstellt und integriert sich dynamisch mit dem Knowledge Graph.

source: JudaicaLink Pubby provides a *SPARQL endpoint* and a *Linked Data interface* for accessing and querying RDF data.
de: JudaicaLink Pubby bietet einen *SPARQL-Endpunkt* und eine *Linked Data-Schnittstelle* zum Zugriff auf und Abfragen von RDF-Daten.

source: Powered by *Apache Jena Fuseki*
de: Angetrieben von *Apache Jena Fuseki*

source: Provides *triple-store access* for external applications
de: Bietet *Triple-Store-Zugriff* für externe Anwendungen

source: 4. JudaicaLink Generators
de: 4. JudaicaLink Generatoren

source: This project contains *data ingestion scripts* that transform external data sources into *RDF triples*, making them usable in JudaicaLink.
de: Dieses Projekt enthält *Daten-Eingabe-Skripte*, die externe Datenquellen in *RDF-Tripel* umwandeln und sie in JudaicaLink nutzbar machen.

source: A library for generating RDF files from structured and unstructured data sources, such as websites, spreadsheets, and full-text documents.
de: Ein Bibliothek zur Generierung von RDF-Dateien aus strukturierten und unstrukturierten Datenquellen wie Websites, Tabellenkalkulationen und Volltextdokumenten.

source: A script that loads datasets into the triple store. It processes RDF dumps, enriches them with metadata, and uploads them to Fuseki.
de: Ein Skript, das Datensätze in den Triple-Store lädt. Es verarbeitet RDF-Dumps, angereichert sie mit Metadaten und lädt sie in Fuseki hoch.

source: How JudaicaLink Works
de: Wie JudaicaLink funktioniert

source: JudaicaLink aggregates, processes, and serves structured Jewish studies data. The main workflow involves:
de: JudaicaLink aggregiert, verarbeitet und stellt strukturierte Daten aus den Jüdischen Studien bereit. Der Hauptarbeitsablauf umfasst:

source: *Data Collection*: Extracting datasets from archives, digital libraries, and authority files.
de: *Datenbeschaffung*: Extrahieren von Datensätzen aus Archiven, digitalen Bibliotheken und Normdateien.

source: *Data Transformation*: Converting collected data into RDF format using the *JudaicaLink RDF Generator*.
de: *Datenverarbeitung*: Konvertieren der gesammelten Daten in RDF-Format mit dem *JudaicaLink RDF Generator*.

source: *Data Enrichment*: Linking entities across different sources and connecting them to *external databases* (e.g., GND, Wikidata, VIAF).
de: *Datenanreicherung*: Verknüpfen von Entitäten aus verschiedenen Quellen und Verbinden mit *externen Datenbanken* (z.B. GND, Wikidata, VIAF).

source: *Data Storage*: Storing RDF data in *Apache Jena Fuseki* (triple store) for efficient querying.
de: *Datenablage*: Speichern von RDF-Daten in *Apache Jena Fuseki* (Triple-Store) für effiziente Abfragen.

source: *Public Access*: Making the data available via: - *SPARQL Endpoint* for custom queries - *JudaicaLink Labs* for easy entity search - *JudaicaLink Site* for human-readable overviews
de: *Öffentlicher Zugang*: Bereitstellung der Daten über: - *SPARQL-Endpunkt* für benutzerdefinierte Abfragen - *JudaicaLink Labs* für eine einfache Entitätssuche - *JudaicaLink Site* für menschenlesbare Übersichten

source: How to Use JudaicaLink
de: Wie man JudaicaLink nutzt

source: For Researchers and Historians
de: Für Forscher und Historiker

source: *Search for Jewish figures, places, and events* using the Labs interface.
de: *Suche nach jüdischen Persönlichkeiten, Orten und Ereignissen* mit der Labs-Schnittstelle.

source: *Access structured datasets* to support academic research.
de: *Zugriff auf strukturierte Datensätze* zur Unterstützung der akademischen Forschung.

source: *Run SPARQL queries* to extract complex relationships and insights.
de: *Führe SPARQL-Abfragen aus*, um komplexe Beziehungen und Erkenntnisse zu extrahieren.

source: For Developers and Data Scientists
de: Für Entwickler und Datenwissenschaftler

source: *Integrate JudaicaLink data* into external applications via *SPARQL*.
de: *Integriere JudaicaLink-Daten* in externe Anwendungen über *SPARQL*.

source: *Contribute to RDF generation scripts* and help expand the knowledge graph.
de: *Trage zu RDF-Generierungsskripten bei* und hilf dabei, den Knowledge Graph zu erweitern.

source: *Develop new visualizations and analysis tools* based on the dataset.
de: *Entwickle neue Visualisierungen und Analysetools* basierend auf dem Datensatz.

source: For Institutions and Digital Libraries
de: Für Institutionen und digitale Bibliotheken

source: *Link existing digital collections* to JudaicaLink’s structured data.
de: *Verknüpfe bestehende digitale Sammlungen* mit den strukturierten Daten von JudaicaLink.

source: *Share bibliographic and archival metadata* using the RDF format.
de: *Teile bibliografische und archivarische Metadaten* im RDF-Format.

source: *Collaborate on data enrichment efforts* to enhance Jewish studies resources.
de: *Arbeite an Anstrengungen zur Datenanreicherung* mit, um die Ressourcen der Jüdischen Studien zu verbessern.

source: Conclusion
de: Fazit

source: JudaicaLink is an open, collaborative project that enables *structured access to Jewish studies data*. By connecting datasets, enriching metadata, and providing search and query tools, it serves as a valuable *resource for academia, libraries, and digital humanities projects*.
de: JudaicaLink ist ein offenes, kollaboratives Projekt, das *strukturierten Zugang zu Daten aus den Jüdischen Studien* ermöglicht. Indem es Datensätze verbindet, Metadaten anreichert und Such- und Abfragewerkzeuge bereitstellt, dient es als wertvolle *Ressource für die Akademie, Bibliotheken und digitale Geisteswissenschaftsprojekte*.

source: \🔗 *Start Exploring*: `https://www.judaicalink.org <https://www.judaicalink.org>`_
de: \🔗 *Beginnen Sie mit der Erkundung*: `https://www.judaicalink.org <https://www.judaicalink.org>`_
