Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/user_guide/datasets.po
Languages: de

source: Datasets in JudaicaLink
de: Datensätze in JudaicaLink

source: JudaicaLink provides structured datasets that integrate Jewish studies sources into a Linked Open Data (LOD) knowledge graph. These datasets are accessible via SPARQL queries, downloadable RDF dumps, and through the JudaicaLink API.
de: JudaicaLink stellt strukturierte Datensätze bereit, die Quellen der jüdischen Studien in einen Linked Open Data (LOD) Wissensgraphen integrieren. Diese Datensätze sind über SPARQL-Abfragen, herunterladbare RDF-Dumps und die JudaicaLink API zugänglich.

source: Available Datasets
de: Verfügbare Datensätze

source: The following datasets are included in JudaicaLink:
de: Die folgenden Datensätze sind in JudaicaLink enthalten:

source: 1. YIVO Encyclopedia
de: 1. YIVO-Enzyklopädie

source: Description: Biographical and historical entries from the YIVO Institute for Jewish Research.
de: Beschreibung: Biografische und historische Einträge aus dem YIVO Institute for Jewish Research.

source: Entities: Persons, places, and organizations.
de: Entitäten: Personen, Orte und Organisationen.

source: Data Access:
de: Datenzugriff:

source: SPARQL: Query at `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_
de: SPARQL: Abfragen unter `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_

source: Entity Pages: `https://data.judaicalink.org/data/html/yivo/ <https://data.judaicalink.org/data/html/yivo/>`_
de: Entitätsseiten: `https://data.judaicalink.org/data/html/yivo/ <https://data.judaicalink.org/data/html/yivo/>`_

source: Description: Data on commemorative stones dedicated to Holocaust victims.
de: Beschreibung: Daten zu Gedenksteinen für Holocaust-Opfer.

source: Entities: Persons and memorial sites.
de: Entitäten: Personen und Gedenkstätten.

source: SPARQL: Query dataset under `stolpersteine`
de: SPARQL: Abfrage des Datensatzes unter `stolpersteine`

source: Entity Pages: `https://data.judaicalink.org/data/html/stolpersteine/ <https://data.judaicalink.org/data/html/stolpersteine/>`_
de: Entitätsseiten: `https://data.judaicalink.org/data/html/stolpersteine/ <https://data.judaicalink.org/data/html/stolpersteine/>`_

source: Description: Biographical records of Jewish rabbis from various historical periods.
de: Beschreibung: Biografische Aufzeichnungen über jüdische Rabbiner aus verschiedenen historischen Epochen.

source: Entities: Persons, institutions, and related documents.
de: Entitäten: Personen, Institutionen und zugehörige Dokumente.

source: SPARQL queries available for detailed searches.
de: SPARQL-Abfragen für detaillierte Recherchen verfügbar.

source: 4. Footprints - Jewish Books through Time and Place
de: 4. Footprints – Jüdische Bücher durch Zeit und Raum

source: Description: A dataset tracing the movement of Jewish books across different regions and owners.
de: Beschreibung: Ein Datensatz, der die Bewegung jüdischer Bücher durch verschiedene Regionen und Besitzer nachverfolgt.

source: Entities: Books, authors, owners, locations.
de: Entitäten: Bücher, Autoren, Besitzer, Standorte.

source: SPARQL: Query at `footprints` dataset.
de: SPARQL: Abfrage des Datensatzes `footprints`.

source: JSON-LD Access: `https://data.judaicalink.org/data/jsonld/footprints/`
de: JSON-LD-Zugriff: `https://data.judaicalink.org/data/jsonld/footprints/`

source: 5. Compact Memory (CM) Indexed Entities
de: 5. Compact Memory (CM) indizierte Entitäten

source: Description: Extracted named entities (persons, locations, topics) from historical Jewish periodicals.
de: Beschreibung: Extrahierte benannte Entitäten (Personen, Orte, Themen) aus historischen jüdischen Zeitschriften.

source: Entities: Persons, places, organizations, topics.
de: Entitäten: Personen, Orte, Organisationen, Themen.

source: Next Steps
de: Nächste Schritte

source: Learn how to refine your **SPARQL queries** in the :ref:`SPARQL Guide <advanced_topics_sparql_guide>`.
de: Erfahren Sie, wie Sie Ihre **SPARQL-Abfragen** verfeinern können im :ref:`SPARQL-Leitfaden <advanced_topics_sparql_guide>`.

source: If you need help, check the :ref:`FAQs <faq>` or contact us at `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
de: Falls Sie Hilfe benötigen, schauen Sie in den :ref:`FAQs <faq>` oder kontaktieren Sie uns unter `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
