Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/user_guide/overview.po
Languages: de

source: User Guide Overview
de: Übersicht des Benutzerhandbuchs

source: Welcome to the JudaicaLink User Guide! This guide will help you navigate and effectively use the different features and resources available within JudaicaLink.
de: Willkommen im JudaicaLink-Benutzerhandbuch! Dieses Handbuch hilft Ihnen, die verschiedenen Funktionen und Ressourcen von JudaicaLink zu verstehen und effektiv zu nutzen.

source: What is JudaicaLink?
de: Was ist JudaicaLink?

source: JudaicaLink is a Linked Open Data project dedicated to Jewish studies, providing structured and interconnected knowledge about Jewish history, culture, and scholarship. It integrates multiple datasets, making them easily accessible through a knowledge graph, entity-based searches, and a SPARQL endpoint.
de: JudaicaLink ist ein Linked Open Data-Projekt, das sich mit jüdischen Studien befasst. Es bietet strukturiertes und vernetztes Wissen über die jüdische Geschichte, Kultur und Wissenschaft. JudaicaLink integriert mehrere Datensätze und stellt sie über einen Wissensgraphen, Entitätensuchen und einen SPARQL-Endpunkt zur Verfügung.

source: Key Features
de: Hauptfunktionen

source: 1. Search Functionality
de: 1. Suchfunktion

source: JudaicaLink offers multiple ways to search and explore data:
de: JudaicaLink bietet mehrere Möglichkeiten, Daten zu durchsuchen und zu erkunden:

source: *Knowledge Graph Search*: Search for persons, places, institutions, and other entities in structured data.
de: *Wissensgraph-Suche*: Suche nach Personen, Orten, Institutionen und anderen Entitäten in strukturierten Daten.

source: *Full-Text Search in Compact Memory*: Query historical Jewish newspapers and documents.
de: *Volltextsuche in Compact Memory*: Durchsuchen historischer jüdischer Zeitungen und Dokumente.

source: *Entity Extraction Search*: Find entities automatically identified within historical texts using NLP.
de: *Entitätenextraktion-Suche*: Finde Entitäten, die mithilfe von NLP-Technologien automatisch aus historischen Texten extrahiert wurden.

source: 2. SPARQL Endpoint
de: 2. SPARQL-Endpunkt

source: For advanced users, JudaicaLink provides a *SPARQL query interface* , enabling custom queries against the structured knowledge graph.
de: Für fortgeschrittene Benutzer bietet JudaicaLink eine *SPARQL-Abfrageschnittstelle*, die benutzerdefinierte Abfragen gegen den strukturierten Wissensgraphen ermöglicht.

source: \🔗 *Access the SPARQL endpoint:* `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.
de: \🔗 *Zugriff auf den SPARQL-Endpunkt:* `https://data.judaicalink.org/sparql.html <https://data.judaicalink.org/sparql.html>`_.

source: Learn how to construct SPARQL queries in the `SPARQL Guide <advanced_topic_sparql_guide>`_.
de: Erfahren Sie, wie Sie SPARQL-Abfragen erstellen können, im `SPARQL-Leitfaden <advanced_topic_sparql_guide>`_.

source: 3. Linked Open Data (LOD) Integration
de: 3. Integration in Linked Open Data (LOD)

source: JudaicaLink integrates with major Linked Data resources such as *GND, Wikidata, DBpedia, VIAF, and Geonames*, allowing enriched and interconnected research.
de: JudaicaLink ist mit wichtigen Linked Data-Ressourcen wie *GND, Wikidata, DBpedia, VIAF und Geonames* verknüpft, was eine verbesserte und vernetzte Forschung ermöglicht.

source: 4. Dataset Exploration
de: 4. Datensatzerkundung

source: Browse available datasets via `https://data.judaicalink.org <https://data.judaicalink.org>`_.
de: Durchsuchen Sie verfügbare Datensätze unter `https://data.judaicalink.org <https://data.judaicalink.org>`_.

source: Understand how datasets are structured in the `Dataset Guide <datasets>`.
de: Erfahren Sie mehr über die Struktur der Datensätze im `Datensatz-Leitfaden <datasets>`.

source: 5. Entity Pages
de: 5. Entitätsseiten

source: JudaicaLink provides *Entity Pages*, which aggregate information from multiple sources about an entity.
de: JudaicaLink bietet *Entitätsseiten*, die Informationen aus mehreren Quellen über eine Entität zusammenführen.

source: See examples of entity pages at: `https://data.judaicalink.org/data/html/ <https://data.judaicalink.org/data/html/>`_.
de: Beispiele für Entitätsseiten finden Sie unter: `https://data.judaicalink.org/data/html/ <https://data.judaicalink.org/data/html/>`_.

source: How to Use This Guide
de: Wie man dieses Handbuch benutzt

source: This guide is divided into several sections to help users get started with JudaicaLink:
de: Dieses Handbuch ist in mehrere Abschnitte unterteilt, um Benutzern den Einstieg in JudaicaLink zu erleichtern:

source: :ref:`Getting Started <getting_started>` – A step-by-step guide to accessing JudaicaLink.
de: :ref:`Getting Started <getting_started>` – Eine Schritt-für-Schritt-Anleitung zum Zugriff auf JudaicaLink.

source: :ref:`Search Guide <user_guide_search_guide>` – Instructions on how to use the different search methods.
de: :ref:`Search Guide <user_guide_search_guide>` – Anleitungen zur Verwendung der verschiedenen Suchmethoden.

source: :ref:`SPARQL Guide <advanced_topics_sparql_guide>` – How to construct SPARQL queries.
de: :ref:`SPARQL Guide <advanced_topics_sparql_guide>` – Wie man SPARQL-Abfragen erstellt.

source: :ref:`Dataset Guide <datasets>` – Information about the datasets available.
de: :ref:`Dataset Guide <datasets>` – Informationen zu den verfügbaren Datensätzen.

source: :ref:`Content Negotiation <user_guide_content_negotiation>` – Learn how to retrieve data in different formats.
de: :ref:`Content Negotiation <user_guide_content_negotiation>` – Erfahren Sie, wie Sie Daten in verschiedenen Formaten abrufen können.

source: :ref:`FAQs <faq>` – Answers to common questions.
de: :ref:`FAQs <faq>` – Antworten auf häufige Fragen.

source: Who Can Use JudaicaLink?
de: Wer kann JudaicaLink nutzen?

source: JudaicaLink is designed for:
de: JudaicaLink ist konzipiert für:

source: *Researchers & Historians* looking for structured Jewish studies data.
de: *Forscher & Historiker*, die strukturierte Daten zu jüdischen Studien suchen.

source: *Librarians & Archivists* managing bibliographic and archival data.
de: *Bibliothekare & Archivare*, die bibliografische und archivierte Daten verwalten.

source: *Developers & Data Scientists* integrating JudaicaLink data into applications.
de: *Entwickler & Datenwissenschaftler*, die JudaicaLink-Daten in Anwendungen integrieren.

source: *General Users* interested in exploring Jewish history and culture.
de: *Allgemeine Nutzer*, die sich für die jüdische Geschichte und Kultur interessieren.

source: Next Steps
de: Nächste Schritte

source: Start with :ref:`Getting Started <getting_started>`.
de: Beginnen Sie mit :ref:`Getting Started <getting_started>`.

source: If you need help, visit the :ref:`FAQs <faq>` or contact us at `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
de: Wenn Sie Hilfe benötigen, besuchen Sie die :ref:`FAQs <faq>` oder kontaktieren Sie uns unter `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
