Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/developer_guide/api_reference.po
Languages: de

source: API Reference
de: API-Referenz

source: The JudaicaLink API provides programmatic access to linked data, including **entities, datasets, and SPARQL queries**. This guide outlines available API endpoints and how to interact with them.
de: Die JudaicaLink-API bietet programmatischen Zugriff auf verknüpfte Daten, einschließlich **Entitäten, Datensätzen und SPARQL-Abfragen**. Dieser Leitfaden beschreibt verfügbare API-Endpunkte.

source: Base API URL: `https://data.judaicalink.org/api/`
de: Basis-URL der API: `https://data.judaicalink.org/api/`

source: Authentication
de: Authentifizierung

source: Currently, the JudaicaLink API is **publicly accessible** and does not require authentication.
de: Derzeit ist die JudaicaLink-API **öffentlich zugänglich** und erfordert keine Authentifizierung.

source: Endpoints
de: Endpunkte

source: 1. Retrieve Entity Data
de: 1. Entitätsdaten abrufen

source: **Endpoint:**
de: **Endpunkt:**

source: **Description:** Retrieves structured RDF data about a specific entity.
de: **Beschreibung:** Ruft strukturierte RDF-Daten zu einer bestimmten Entität ab.

source: **Example Request:**
de: **Beispielanfrage:**

source: **Response (JSON-LD Example):**
de: **Antwort (JSON-LD-Beispiel):**

source: 2. Search Entities
de: 2. Entitäten suchen

source: **Description:** Performs a full-text search across JudaicaLink’s knowledge graph.
de: **Beschreibung:** Führt eine Volltextsuche über den Wissensgraphen von JudaicaLink durch.

source: **Parameters:**
de: **Parameter:**

source: `q` (required) - Search query term
de: `q` (erforderlich) - Suchbegriff

source: `limit` (optional, default: 10) - Number of results to return
de: `limit` (optional, Standardwert: 10) - Anzahl der zurückzugebenden Ergebnisse

source: 3. List Available Datasets
de: 3. Verfügbare Datensätze auflisten

source: **Description:** Returns metadata about all datasets available in JudaicaLink.
de: **Beschreibung:** Gibt Metadaten zu allen in JudaicaLink verfügbaren Datensätzen zurück.

source: **Example Response:**
de: **Beispielantwort:**

source: 4. Run SPARQL Queries
de: 4. SPARQL-Abfragen ausführen

source: **Description:** Executes a SPARQL query on the JudaicaLink knowledge graph.
de: **Beschreibung:** Führt eine SPARQL-Abfrage im Wissensgraphen von JudaicaLink aus.

source: `query` (required) - SPARQL query string
de: `query` (erforderlich) - SPARQL-Abfragezeichenfolge

source: **Response Format:** - JSON (`Accept: application/json`) - XML (`Accept: application/xml`)
de: **Antwortformat:** - JSON (`Accept: application/json`) - XML (`Accept: application/xml`)

source: Error Handling
de: Fehlerbehandlung

source: The API returns standard HTTP status codes:
de: Die API gibt Standard-HTTP-Statuscodes zurück:

source: `200 OK` - Successful request
de: `200 OK` - Erfolgreiche Anfrage

source: `400 Bad Request` - Invalid parameters
de: `400 Bad Request` - Ungültige Parameter

source: `404 Not Found` - Resource does not exist
de: `404 Not Found` - Ressource existiert nicht

source: `500 Internal Server Error` - Server-side issue
de: `500 Internal Server Error` - Serverseitiges Problem

source: Usage Limits & Best Practices
de: Nutzungslimits und bewährte Verfahren

source: **Rate Limits**: The API enforces request limits to prevent abuse. If you encounter a `429 Too Many Requests` response, reduce the request frequency.
de: **Ratenbegrenzungen**: Die API setzt Anforderungslimits durch, um Missbrauch zu verhindern. Wenn Sie eine `429 Too Many Requests`-Antwort erhalten, reduzieren Sie die Anforderungshäufigkeit.

source: **Efficient Queries**: Use filters and `LIMIT` clauses in SPARQL queries to improve response times.
de: **Effiziente Abfragen**: Verwenden Sie Filter und `LIMIT`-Klauseln in SPARQL-Abfragen, um die Antwortzeiten zu verbessern.

source: **Data Caching**: Cache frequently accessed results to reduce load on the API.
de: **Daten-Caching**: Cachen Sie häufig abgerufene Ergebnisse, um die Belastung der API zu reduzieren.

source: Support
de: Unterstützung

source: For assistance, contact: `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.
de: Für Unterstützung kontaktieren Sie: `https://labs.judaicalink.org/contact/ <https://labs.judaicalink.org/contact/>`_.

source: --- The JudaicaLink API provides structured, linked data for Jewish studies. Explore the datasets and integrate them into your projects! \🚀
de: --- Die JudaicaLink-API bietet strukturierte, verknüpfte Daten für jüdische Studien. Erkunden Sie die Datensätze und integrieren Sie sie in Ihre Projekte! \🚀
