Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/developer_guide/contributing.po
Languages: de

source: Contributing to JudaicaLink Projects
de: Zu JudaicaLink-Projekten beitragen

source: Thank you for your interest in contributing to JudaicaLink! This guide provides an overview of how you can contribute to various projects within the JudaicaLink ecosystem, including **Docs, Labs, Site, Pubby, Generators, and RDF-related tools**.
de: Vielen Dank für Ihr Interesse an der Mitarbeit an JudaicaLink! Dieser Leitfaden gibt einen Überblick darüber, wie Sie zu verschiedenen Projekten innerhalb des JudaicaLink-Ökosystems beitragen können, einschließlich **Docs, Labs, Site, Pubby, Generators und RDF-bezogenen Tools**.

source: General Contribution Guidelines
de: Allgemeine Richtlinien für Beiträge

source: JudaicaLink is an open-source initiative. Contributions can include:
de: JudaicaLink ist eine Open-Source-Initiative. Beiträge können Folgendes umfassen:

source: Reporting and fixing bugs
de: Fehlerberichte und -behebungen

source: Improving documentation
de: Dokumentation verbessern

source: Adding new features
de: Neue Funktionen hinzufügen

source: Enhancing RDF datasets and linked data
de: RDF-Datensätze und Linked Data verbessern

source: Optimizing performance
de: Leistung optimieren

source: All contributions should follow our coding standards and best practices.
de: Alle Beiträge sollten unseren Codierungsstandards und Best Practices folgen.

source: Setting Up Your Development Environment
de: Einrichten Ihrer Entwicklungsumgebung

source: 1. Clone the Repository
de: 1. Repository klonen

source: Choose the project you want to contribute to and clone its repository: ::
de: Wählen Sie das Projekt aus, zu dem Sie beitragen möchten, und klonen Sie sein Repository: ::

source: 2. Set Up a Virtual Environment
de: 2. Ein virtuelles Umfeld einrichten

source: *(For Python-based projects like Labs and Pubby)*
de: *(Für Python-basierte Projekte wie Labs und Pubby)*

source: 3. Install Dependencies
de: 3. Abhängigkeiten installieren

source: For front-end projects like the **JudaicaLink Site**, install dependencies using **Hugo**: ::
de: Für Frontend-Projekte wie die **JudaicaLink Site** installieren Sie Abhängigkeiten mit **Hugo**: ::

source: For containerized development using **Docker**: ::
de: Für containerisierte Entwicklung mit **Docker**: ::

source: Project-Specific Contributions
de: Projektspezifische Beiträge

source: Update or create `.rst` documentation files in `docs/`.
de: Aktualisieren oder erstellen Sie `.rst`-Dokumentationsdateien in `docs/`.

source: Build and preview documentation:
de: Dokumentation erstellen und anzeigen:

source: Submit improvements via a pull request.
de: Verbesserungen über einen Pull-Request einreichen.

source: Improve search functionality, indexing, and data integration.
de: Verbessern Sie die Suchfunktion, Indizierung und Datenintegration.

source: Work on **Django-based** features.
de: Arbeiten Sie an **Django-basierten** Funktionen.

source: Run the development server:
de: Entwicklungsserver ausführen:

source: JudaicaLink Site
de: JudaicaLink Seite

source: Improve UI/UX for the static site.
de: Verbessern Sie das UI/UX für die statische Seite.

source: Modify `config.toml` and `content/` for new pages.
de: Ändern Sie `config.toml` und `content/` für neue Seiten.

source: Preview site changes:
de: Seitenänderungen anzeigen:

source: Enhance SPARQL querying and linked data support.
de: Verbessern Sie SPARQL-Abfragen und Linked Data-Unterstützung.

source: Improve the Jena Fuseki-based triple store.
de: Verbessern Sie den auf Jena Fuseki basierenden Triple Store.

source: Test Pubby:
de: Pubby testen:

source: JudaicaLink Generators & RDF Tools
de: JudaicaLink Generatoren & RDF-Werkzeuge

source: Improve data ingestion pipelines.
de: Verbessern Sie die Daten-Eingabepipelines.

source: Enhance RDF transformation scripts.
de: Verbessern Sie RDF-Transformations-Skripte.

source: Validate RDF outputs with:
de: Validieren Sie RDF-Ausgaben mit:

source: Submitting a Pull Request
de: Ein Pull-Request einreichen

source: Fork the repository on GitHub.
de: Forken Sie das Repository auf GitHub.

source: Create a new feature branch:
de: Erstellen Sie einen neuen Feature-Zweig:

source: Make changes and commit them:
de: Machen Sie Änderungen und committen Sie sie:

source: Push to your fork:
de: Pushen Sie in Ihren Fork:

source: Open a pull request on GitHub and describe your changes.
de: Öffnen Sie einen Pull-Request auf GitHub und beschreiben Sie Ihre Änderungen.

source: Reporting Issues
de: Probleme melden

source: If you encounter a bug, have a feature request, or need help, open an issue in the relevant GitHub repository:
de: Wenn Sie einen Fehler finden, eine Funktionsanfrage haben oder Hilfe benötigen, öffnen Sie ein Problem im entsprechenden GitHub-Repository:

source: **Generators:** `https://github.com/judaicalink/judaicalink-generators/issues <https://github.com/judaicalink/judaicalink-generators/issues>`_
de: **Generatoren:** `https://github.com/judaicalink/judaicalink-generators/issues <https://github.com/judaicalink/judaicalink-generators/issues>`_

source: Code of Conduct
de: Verhaltenskodex

source: All contributors are expected to follow the **JudaicaLink Code of Conduct** to ensure a respectful and collaborative environment.
de: Es wird erwartet, dass alle Beitrag leistenden Personen den **JudaicaLinkVerhaltenskodex** befolgen, um eine respektvolle und kollaborative Umgebung zugewährleisten.

source: --- Thank you for contributing to JudaicaLink! \🚀
de: --- Vielen Dank für Ihre Mitarbeit an JudaicaLink! \🚀
