Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/developer_guide/deployment.po
Languages: de

source: Deployment Guide
de: Bereitstellungsanleitung

source: This guide provides instructions for deploying the JudaicaLink projects in a production environment, including **Django-based applications, Solr, Redis, Apache Jena Fuseki, and Nginx** .
de: Diese Anleitung bietet Anweisungen zur Bereitstellung der JudaicaLink-Projekte in einer Produktionsumgebung, einschließlich **Django-basierter Anwendungen, Solr, Redis, Apache Jena Fuseki und Nginx**.

source: System Requirements
de: Systemanforderungen

source: Ensure your system meets the following requirements:
de: Stellen Sie sicher, dass Ihr System die folgenden Anforderungen erfüllt:

source: **OS:** Ubuntu 22.04 LTS (recommended)
de: **Betriebssystem:** Ubuntu 22.04 LTS (empfohlen)

source: **Docker & Docker Compose:** Latest version
de: **Docker & Docker Compose:** Neueste Version

source: **Nginx:** Latest version
de: **Nginx:** Neueste Version

source: Setting Up the Server
de: Einrichten des Servers

source: Update the system
de: System aktualisieren

source: Create a new user for deployment
de: Einen neuen Benutzer für die Bereitstellung erstellen

source: Setting Up PostgreSQL
de: Einrichten von PostgreSQL

source: 1. Install PostgreSQL
de: 1. PostgreSQL installieren

source: 2. Create a database and user
de: 2. Eine Datenbank und einen Benutzer erstellen

source: Setting Up Python Environment
de: Einrichten der Python-Umgebung

source: 1. Install Python dependencies
de: 1. Python-Abhängigkeiten installieren

source: Setting Up Solr
de: Einrichten von Solr

source: 1. Install Solr
de: 1. Solr installieren

source: 2. Start Solr and create core
de: 2. Solr starten und einen Core erstellen

source: Setting Up Redis
de: Einrichten von Redis

source: Setting Up Apache Jena Fuseki
de: Einrichten von Apache Jena Fuseki

source: 1. Download and Install Fuseki
de: 1. Fuseki herunterladen und installieren

source: 2. Start Fuseki server
de: 2. Fuseki-Server starten

source: 3. Load RDF data
de: 3. RDF-Daten laden

source: Setting Up Nginx
de: Einrichten von Nginx

source: 1. Install Nginx
de: 1. Nginx installieren

source: 2. Configure Nginx for JudaicaLink
de: 2. Nginx für JudaicaLink konfigurieren

source: Add the following configuration:
de: Fügen Sie die folgende Konfiguration hinzu:

source: 3. Enable the Nginx configuration
de: 3. Die Nginx-Konfiguration aktivieren

source: Deploying the Django Application
de: Bereitstellung der Django-Anwendung

source: 1. Set up environment variables
de: 1. Umgebungsvariablen einrichten

source: 2. Run migrations and collect static files
de: 2. Migrationen ausführen und statische Dateien sammeln

source: 3. Start the Gunicorn service
de: 3. Den Gunicorn-Dienst starten

source: Automating Deployment with Docker
de: Automatisierung der Bereitstellung mit Docker

source: For easier deployment, use **Docker Compose**.
de: Für eine einfachere Bereitstellung verwenden Sie **Docker Compose**.

source: 1. Install Docker and Docker Compose
de: 1. Docker und Docker Compose installieren

source: 2. Run Docker Compose
de: 2. Docker Compose ausführen

source: Verifying the Deployment
de: Überprüfung der Bereitstellung

source: Check that all services are running correctly:
de: Überprüfen Sie, ob alle Dienste korrekt laufen:

source: **Django Application:** http://127.0.0.1:8000
de: **Django-Anwendung:** http://127.0.0.1:8000

source: **SPARQL Endpoint:** http://localhost:3030/ds
de: **SPARQL-Endpunkt:** http://localhost:3030/ds

source: Troubleshooting & Support
de: Fehlerbehebung & Support

source: **Database connection errors?** Ensure PostgreSQL is running and credentials are correct.
de: **Datenbankverbindungsfehler?** Stellen Sie sicher, dass PostgreSQL läuft und die Anmeldeinformationen korrekt sind.

source: **Nginx not serving requests?** Check logs with:
de: **Nginx bearbeitet keine Anfragen?** Überprüfen Sie die Protokolle mit:

source: **Gunicorn process stopped?** Restart it:
de: **Gunicorn-Prozess gestoppt?** Starten Sie ihn neu:

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/

source: --- This guide ensures a robust and scalable production deployment of JudaicaLink. 🚀
de: --- Diese Anleitung gewährleistet eine robuste und skalierbare Bereitstellung von JudaicaLink. 🚀
