Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/developer_guide/docker.po
Languages: de

source: Docker Setup and Deployment
de: Docker-Einrichtung und Bereitstellung

source: This guide explains how to set up and deploy the JudaicaLink projects using **Docker** and **Docker Compose**. This setup allows you to run all services in isolated containers for easy deployment and management.
de: Diese Anleitung erklärt, wie Sie die JudaicaLink-Projekte mit **Docker** und **Docker Compose** einrichten und bereitstellen. Diese Konfiguration ermöglicht das Ausführen aller Dienste in isolierten Containern für eine einfache Bereitstellung und Verwaltung.

source: System Requirements
de: Systemanforderungen

source: Ensure your system has the following installed:
de: Stellen Sie sicher, dass Ihr System die folgenden Anforderungen erfüllt:

source: **Docker:** Latest version (`Docker Installation Guide <https://docs.docker.com/get-docker/>`_)
de: **Docker:** Neueste Version (`Docker-Installationsanleitung <https://docs.docker.com/get-docker/>`_)

source: **Docker Compose:** Latest version (`Docker Compose Installation Guide <https://docs.docker.com/compose/install/>`_)
de: **Docker Compose:** Neueste Version (`Docker Compose Installationsanleitung <https://docs.docker.com/compose/install/>`_)

source: Cloning the Repository
de: Repository klonen

source: First, clone the main Docker repository for JudaicaLink:
de: Zuerst das Haupt-Docker-Repository für JudaicaLink klonen:

source: Setting Up the Environment
de: Einrichten der Umgebung

source: Create an **.env** file to store environment variables:
de: Erstellen Sie eine **.env**-Datei, um Umgebungsvariablen zu speichern:

source: Modify the variables to match your setup, including database credentials and service configurations.
de: Passen Sie die Variablen an Ihre Konfiguration an, einschließlich Datenbankzugangsdaten und Dienstkonfigurationen.

source: Running Docker Containers
de: Docker-Container ausführen

source: **Build and start containers**:
de: **Container erstellen und starten**:

source: **Check running containers**:
de: **Laufende Container überprüfen**:

source: **View logs for troubleshooting**:
de: **Logs für Fehlerbehebung anzeigen**:

source: Services Included in Docker Compose
de: In Docker Compose enthaltene Dienste

source: The `docker-compose.yml` file includes the following services:
de: Die `docker-compose.yml`-Datei enthält die folgenden Dienste:

source: **Django Application** (JudaicaLink Labs & Pubby)
de: **Django-Anwendung** (JudaicaLink Labs & Pubby)

source: **PostgreSQL** (Database backend for Django)
de: **PostgreSQL** (Datenbank-Backend für Django)

source: **Solr** (Full-text search engine)
de: **Solr** (Volltextsuchmaschine)

source: **Redis** (Caching layer for Django)
de: **Redis** (Caching-Schicht für Django)

source: **Apache Jena Fuseki** (SPARQL endpoint)
de: **Apache Jena Fuseki** (SPARQL-Endpunkt)

source: **Nginx** (Reverse proxy for serving the application)
de: **Nginx** (Reverse Proxy zur Bereitstellung der Anwendung)

source: Managing Docker Containers
de: Verwaltung von Docker-Containern

source: **Stop all running containers**:
de: **Alle laufenden Container stoppen**:

source: **Restart containers**:
de: **Container neu starten**:

source: **Rebuild containers after making changes**:
de: **Container nach Änderungen neu erstellen**:

source: Interacting with Services
de: Interaktion mit Diensten

source: Running Database Migrations
de: Datenbankmigrationen ausführen

source: To apply Django migrations inside the container:
de: Django-Migrationen im Container ausführen:

source: Collecting Static Files
de: Statische Dateien sammeln

source: To collect static files for Django:
de: Statische Dateien für Django sammeln:

source: Running a Bash Shell inside a Container
de: Eine Bash-Shell innerhalb eines Containers ausführen

source: To open a shell inside the Django container:
de: Eine Shell im Django-Container öffnen:

source: Running Solr in Docker
de: Solr in Docker ausführen

source: To access the Solr admin panel:
de: Um auf das Solr-Admin-Panel zuzugreifen:

source: To create a new Solr core:
de: Um einen neuen Solr-Kern zu erstellen:

source: Running Apache Jena Fuseki in Docker
de: Apache Jena Fuseki in Docker ausführen

source: To access Fuseki’s web interface:
de: Um auf die Fuseki-Weboberfläche zuzugreifen:

source: To load RDF data into Fuseki:
de: Um RDF-Daten in Fuseki zu laden:

source: Running Nginx in Docker
de: Nginx in Docker ausführen

source: Nginx serves as a reverse proxy for the Django application. To reload Nginx:
de: Nginx dient als Reverse-Proxy für die Django-Anwendung. Um Nginx neu zu laden:

source: Verifying the Setup
de: Überprüfen der Einrichtung

source: After deployment, verify the services are running correctly:
de: Nach der Bereitstellung überprüfen, ob die Dienste korrekt ausgeführt werden:

source: **SPARQL Endpoint (Fuseki):** http://localhost:3030/ds
de: **SPARQL-Endpunkt (Fuseki):** http://localhost:3030/ds

source: **Solr Admin UI:** http://localhost:8983/solr
de: **Solr-Admin-Oberfläche:** http://localhost:8983/solr

source: Troubleshooting & Support
de: Fehlersuche & Unterstützung

source: **Container not starting?** Check logs with `docker-compose logs -f`
de: **Container startet nicht?** Protokolle mit `docker-compose logs -f` überprüfen

source: **Database connection errors?** Ensure PostgreSQL is running inside the container
de: **Datenbankverbindungsfehler?** Stellen Sie sicher, dass PostgreSQL im Container ausgeführt wird

source: **Application not accessible?** Verify Nginx settings and restart services
de: **Anwendung nicht erreichbar?** Nginx-Einstellungen überprüfen und Dienste neu starten

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Brauchen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/

source: --- Using Docker makes it easy to deploy and manage JudaicaLink services. \🚀
de: --- Mit Docker ist die Bereitstellung und Verwaltung der JudaicaLink-Dienste einfach. \🚀
