Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/developer_guide/setup.po
Languages: de

source: Setup Guide
de: Setup-Anleitung

source: This guide provides instructions on how to set up the JudaicaLink environment locally, including *Solr, Redis, Apache Jena Fuseki, and Nginx* to run the projects efficiently.
de: Diese Anleitung bietet eine Anleitung zur lokalen Einrichtung der JudaicaLink-Umgebung, einschließlich *Solr, Redis, Apache Jena Fuseki und Nginx*, um die Projekte effizient auszuführen.

source: System Requirements
de: Systemanforderungen

source: Ensure your system meets the following requirements:
de: Stellen Sie sicher, dass Ihr System die folgenden Anforderungen erfüllt:

source: *OS:* Ubuntu 20.04+ / macOS / Windows (WSL recommended for Windows)
de: *Betriebssystem:* Ubuntu 20.04+ / macOS / Windows (WSL empfohlen für Windows)

source: *Docker & Docker Compose:* Latest version
de: *Docker & Docker Compose:* Neueste Version

source: *Node.js & npm:* Latest LTS version (for frontend projects)
de: *Node.js & npm:* Neueste LTS-Version (für Frontend-Projekte)

source: *Git:* Latest version
de: *Git:* Neueste Version

source: Cloning the Repositories
de: Klonen der Repositories

source: Clone the main JudaicaLink projects:
de: Klonen Sie die Hauptprojekte von JudaicaLink:

source: Setting Up Python Environment
de: Einrichten der Python-Umgebung

source: Create and activate a virtual environment:
de: Erstellen und aktivieren Sie eine virtuelle Umgebung:

source: Install dependencies:
de: Abhängigkeiten installieren:

source: Setting Up Solr
de: Einrichten von Solr

source: Solr is used for full-text indexing in JudaicaLink Labs.
de: Solr wird für die Volltextindizierung in JudaicaLink Labs verwendet.

source: *Download and extract Solr:*
de: *Solr herunterladen und extrahieren:*

source: *Start Solr in standalone mode:*
de: *Solr im Standalone-Modus starten:*

source: *Create a core for JudaicaLink:*
de: *Erstellen eines Cores für JudaicaLink:*

source: Setting Up Redis
de: Einrichten von Redis

source: Redis is used for caching and queuing operations.
de: Redis wird für Caching- und Warteschlangenoperationen verwendet.

source: *Install Redis:*
de: *Redis installieren:*

source: *Start Redis:*
de: *Redis starten:*

source: Setting Up Apache Jena Fuseki
de: Einrichten von Apache Jena Fuseki

source: Apache Jena Fuseki is used as the SPARQL endpoint and RDF triple store.
de: Apache Jena Fuseki wird als SPARQL-Endpunkt und RDF-Triple-Store verwendet.

source: *Download and extract Fuseki:*
de: *Fuseki herunterladen und extrahieren:*

source: *Start Fuseki server:*
de: *Fuseki-Server starten:*

source: *Load RDF data:*
de: *RDF-Daten laden:*

source: Setting Up Nginx
de: Einrichten von Nginx

source: Nginx is used as a reverse proxy to serve the web applications.
de: Nginx wird als Reverse Proxy zum Bereitstellen der Webanwendungen verwendet.

source: *Install Nginx:*
de: *Nginx installieren:*

source: *Create an Nginx configuration file:*
de: *Erstellen einer Nginx-Konfigurationsdatei:*

source: Add the following configuration:
de: Fügen Sie die folgende Konfiguration hinzu:

source: *Enable the configuration and restart Nginx:*
de: *Konfiguration aktivieren und Nginx neu starten:*

source: Running the Projects
de: Ausführen der Projekte

source: To run the projects locally:
de: Um die Projekte lokal auszuführen:

source: *Run Django-based projects:*
de: *Django-basierte Projekte ausführen:*

source: *Run Hugo-based site:*
de: *Hugo-basierte Website ausführen:*

source: *Run Pubby:*
de: *Pubby ausführen:*

source: Verifying the Setup
de: Überprüfen der Einrichtung

source: Troubleshooting & Support
de: Fehlersuche & Unterstützung

source: *Need help?* Contact us at https://labs.judaicalink.org/contact/.
de: *Benötigen Sie Hilfe?* Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/.

source: --- This setup guide ensures a complete local environment for developing and testing JudaicaLink projects. 🚀
de: --- Diese Setup-Anleitung stellt eine vollständige lokale Umgebung für die Entwicklung und das Testen von JudaicaLink-Projekten sicher. 🚀
