Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/advanced_topics/rdf_model.po
Languages: de

source: RDF Model
de: RDF-Modell

source: The RDF Model provides a structured way to represent and manage RDF data within applications. It allows users to define **entities, properties, and relationships** in a structured format that aligns with Linked Data principles.
de: Das RDF-Modell bietet eine strukturierte Möglichkeit zur Darstellung und Verwaltung von RDF-Daten innerhalb von Anwendungen. Es ermöglicht Benutzern, **Entitäten, Eigenschaften und Beziehungen** in einem strukturierten Format zu definieren, das den Prinzipien von Linked Data entspricht.

source: Features of RDF Model
de: Funktionen des RDF-Modells

source: **Ontology-based data modeling** to maintain semantic consistency.
de: **Ontologie-basiertes Datenmodell** zur Wahrung der semantischen Konsistenz.

source: **SPARQL query support** for retrieving and manipulating data.
de: **SPARQL-Abfrageunterstützung** zur Datenabfrage und -manipulation.

source: **Serialization in multiple RDF formats**, including **RDF/XML, Turtle, JSON-LD, and N-Triples**.
de: **Serialisierung in mehreren RDF-Formaten**, einschließlich **RDF/XML, Turtle, JSON-LD und N-Triples**.

source: **Integration with external linked data sources** like **Wikidata, DBpedia, and GND**.
de: **Integration mit externen Linked Data-Quellen** wie **Wikidata, DBpedia und GND**.

source: Setting Up the Environment
de: Einrichten der Umgebung

source: *Clone the repository*
de: *Repository klonen*

source: *Create a virtual environment* (Recommended)
de: *Virtuelle Umgebung erstellen* (empfohlen)

source: *Install dependencies*
de: *Abhängigkeiten installieren*

source: Defining an RDF Model
de: Definieren eines RDF-Modells

source: Define an RDF model using Python classes. Example model
de: Definieren Sie ein RDF-Modell mit Python-Klassen. Beispielmodell

source: Querying RDF Data
de: Abfragen von RDF-Daten

source: Run SPARQL queries on the RDF model to extract relevant data
de: Führen Sie SPARQL-Abfragen auf dem RDF-Modell aus, um relevante Daten zu extrahieren

source: Validating RDF Data
de: Validierung von RDF-Daten

source: Ensure RDF data is valid before integration
de: Stellen Sie sicher, dass die RDF-Daten vor der Integration gültig sind

source: Alternatively, use an online RDF validator.
de: Alternativ können Sie einen Online-RDF-Validator verwenden.

source: Loading RDF Data into a Triple Store
de: Laden von RDF-Daten in einen Triple-Store

source: To upload RDF data to a **SPARQL endpoint**
de: Zum Hochladen von RDF-Daten an einen **SPARQL-Endpunkt**

source: Troubleshooting & Support
de: Fehlersuche & Unterstützung

source: **SPARQL query not returning results?** Ensure the RDF model is correctly defined.
de: **SPARQL-Abfrage liefert keine Ergebnisse?** Stellen Sie sicher, dass das RDF-Modell korrekt definiert ist.

source: **Serialization errors?** Validate the RDF syntax before saving.
de: **Serialisierungsfehler?** Überprüfen Sie die RDF-Syntax vor dem Speichern.

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Benötigen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/

source: --- The RDF Model simplifies Linked Data management, making it easier to structure, query, and integrate semantic data. \🚀
de: --- Das RDF-Modell vereinfacht das Management von Linked Data, indem es die Strukturierung, Abfrage und Integration semantischer Daten erleichtert. \🚀
