Repository: bsesic/judaicalink-docs
Catalog: docs/locale/*/LC_MESSAGES/advanced_topics/sparql_guide.po
Languages: de

source: SPARQL Guide
de: SPARQL-Leitfaden

source: SPARQL is a query language used to retrieve and manipulate data stored in **RDF format**. JudaicaLink provides a **public SPARQL endpoint** that allows users to query the **JudaicaLink knowledge graph**.
de: SPARQL ist eine Abfragesprache zur Abrufung und Manipulation von Daten, die im **RDF-Format** gespeichert sind. JudaicaLink bietet einen **öffentlichen SPARQL-Endpunkt**, der es ermöglicht, den **JudaicaLink Knowledge Graph** abzufragen.

source: SPARQL Endpoint
de: SPARQL-Endpunkt

source: JudaicaLink's SPARQL endpoint is accessible at:
de: Der SPARQL-Endpunkt von JudaicaLink ist erreichbar unter:

source: You can use this endpoint to run queries directly via a web interface or programmatically using command-line tools or programming languages.
de: Dieser Endpunkt kann verwendet werden, um Abfragen direkt über eine Web-Oberfläche oder programmgesteuert mit Befehlszeilentools oder Programmiersprachen auszuführen.

source: Basic SPARQL Query Structure
de: Grundlegende Struktur einer SPARQL-Abfrage

source: A SPARQL query consists of:
de: Eine SPARQL-Abfrage besteht aus:

source: **SELECT Clause**: Specifies the variables to retrieve.
de: **SELECT-Klausel**: Bestimmt die abzurufenden Variablen.

source: **WHERE Clause**: Defines the conditions that must be met.
de: **WHERE-Klausel**: Definiert die Bedingungen, die erfüllt sein müssen.

source: **LIMIT/OFFSET**: Restricts the number of results.
de: **LIMIT/OFFSET**: Begrenzt die Anzahl der Ergebnisse.

source: Example Query
de: Beispielabfrage

source: Retrieve the first 10 persons in the dataset::
de: Abruf der ersten 10 Personen im Datensatz::

source: Filtering Results
de: Filtern von Ergebnissen

source: Filter results using conditions like **strings, numbers, or dates**::
de: Filtern von Ergebnissen mit Bedingungen wie **Zeichenfolgen, Zahlen oder Daten**::

source: Sorting and Ordering Results
de: Sortieren und Anordnen von Ergebnissen

source: Use **ORDER BY** to sort results::
de: Verwenden Sie **ORDER BY**, um Ergebnisse zu sortieren::

source: Querying with Optional Data
de: Abfragen mit optionalen Daten

source: Use **OPTIONAL** to include additional data if available::
de: Verwenden Sie **OPTIONAL**, um zusätzliche Daten einzuschließen, falls verfügbar::

source: Accessing SPARQL Programmatically
de: Programmgesteuerter Zugriff auf SPARQL

source: Use **cURL** to send SPARQL queries::
de: Verwenden Sie **cURL**, um SPARQL-Abfragen zu senden::

source: Use **Python with rdflib**::
de: Verwenden Sie **Python mit rdflib**::

source: Troubleshooting & Support
de: Fehlersuche & Unterstützung

source: **Query returning no results?** Ensure the dataset contains relevant data.
de: **Abfrage liefert keine Ergebnisse?** Stellen Sie sicher, dass der Datensatz relevante Daten enthält.

source: **SPARQL syntax errors?** Validate your query using a SPARQL validator.
de: **SPARQL-Syntaxfehler?** Überprüfen Sie Ihre Abfrage mit einem SPARQL-Validator.

source: **Need help?** Contact us at https://labs.judaicalink.org/contact/
de: **Benötigen Sie Hilfe?** Kontaktieren Sie uns unter https://labs.judaicalink.org/contact/

source: --- JudaicaLink’s SPARQL endpoint allows for rich, structured data retrieval. Start exploring now! 🚀
de: --- Der SPARQL-Endpunkt von JudaicaLink ermöglicht eine umfassende und strukturierte Datenabfrage. Beginnen Sie jetzt mit der Erkundung! 🚀
